<?php

/*
 * Объявить массив, индексами которого являются буквы русского языка,
 * а значениями – соответствующие латинские буквосочетания
 * (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
 * Написать функцию транслитерации строк.

 */

function translit($str){
    $letters = [
        'а' => 'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'g',
        'д' => 'd',
        'е' => 'e',
        'ё' => 'yo',
        'ж' => 'zh',
        'з' => 'z',
        'и' => 'i',
        'й' => 'y',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'h',
        'ц' => 'c',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'shch',
        'ъ' => "\"",
        'ы' => 'y',
        'ь' => '′',
        'э' => 'e',
        'ю' => 'yu',
        'я' => 'ya'
    ];
    $newStr = '';
    for ($i = 0; $i < mb_strlen($str, 'utf8'); $i++){
        $newStr .= $letters[mb_strcut($str, 2 * $i, 2)]; //Возможно существует более простой метод работы с кириллицей?
    }

    return $newStr;
}
echo translit("привет");
//for ($i = 0; $i < mb_strlen($str, 'utf8'); $i++){
//    echo $i . ": " . mb_strcut($str, 2 * $i, 2) . " ";
//}